Revit 2027 API
ExportLayerTable.GetKeys Method
 Gets all the keys stored in the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ExportLayerKey> GetKeys()
Public Function GetKeys As IList(Of ExportLayerKey)
public:
IList<ExportLayerKey^>^ GetKeys()
member GetKeys : unit -> IList<ExportLayerKey>
Return Value
IList<ExportLayerKey>
 Return the key array.
See Also
Reference
ExportLayerTable Class
Autodesk.Revit.DB Namespace